kir = {'A': 'А', 'a': 'а',	'B': 'Б',	'b': 'б',	'C': 'Ц',	'c': 'ц',	'Č': 'Ч',	'č': 'ч',
       'Ć': 'Ћ', 'ć': 'ћ',	'D': 'Д',	'd': 'д',	'Dž': 'Џ',	'dž': 'џ', 	'Đ': 'Ђ',	'đ': 'ђ',
       'E': 'Е', 'e': 'е',	'F': 'Ф',	'f': 'ф',	'G': 'Г',	'g': 'г',	'H': 'Х',	'h': 'х',
       'I': 'И', 'i': 'и',	'J': 'Ј',	'j': 'ј',	'K': 'К',	'k': 'к',   'L': 'Л',	'l': 'л',
       'Lj': 'Љ',	'lj': 'љ',	'M': 'М',	'm': 'м',	'N': 'Н',	'n': 'н',	'Nj': 'Њ',	'nj': 'њ',
       'O': 'О',	'o': 'о',	'P': 'П',	'p': 'п',	'R': 'Р',	'r': 'р',	'S': 'С',	's': 'с',
       'Š': 'Ш',	'š': 'ш',	'T': 'Т',	't': 'т',	'U': 'У',	'u': 'у',	'V': 'В',	'v': 'в',
       'Z': 'З',	'z': 'з',	'Ž': 'Ж',	'ž': 'ж'}

lat = dict(zip(kir.values(), kir.keys()))

print('Добро пожаловать в Сербизатор! Эта программа поможет осуществить '
      'транслитерацию сербской кириллической азбуки в латинскую или наоборот, с учётом регистра.'
       'Введите слово или фразу, чтобы увидеть результат.')
a = input()
b = list(a)
c = kir.keys()
d = kir.values()
for i in b:
    if i in c:
        for key in kir:
            a = a.replace(key, kir[key])
            print(a)
    if i in d:
        for key in lat:
            a = a.replace(kir[key], key)
            print(a)
